Revit 2024 API
PanelScheduleView.RenumberIndexes Method
 Renumbers the Circuit Naming Index for the circuits in the panel.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public void RenumberIndexes()
Visual Basic
Public Sub RenumberIndexes
Visual C++
public:
void RenumberIndexes()
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace